## pivot()

1. 注意事项：不能有重复项！

In [1]:
import pandas as pd

df = pd.DataFrame(
    {
        "date": ["2024-01", "2024-01", "2024-02", "2024-02"],
        "city": ["Beijing", "Shanghai", "Beijing", "Shanghai"],
        "temperature": [5, 8, 7, 10],
    }
)
df

      date      city  temperature
0  2024-01   Beijing            5
1  2024-01  Shanghai            8
2  2024-02   Beijing            7
3  2024-02  Shanghai           10

In [2]:
df_pivot = df.pivot(index="date", columns="city", values="temperature")
df_pivot

city     Beijing  Shanghai
date
2024-01        5         8
2024-02        7        10

## pivot_table()

1. 注意事项：重复项默认取均值

In [3]:
import pandas as pd

df = pd.DataFrame(
    {
        "region": ["East", "East", "West", "West", "East", "West"],
        "product": ["A", "B", "A", "B", "A", "A"],
        "sales": [100, 150, 80, 200, 130, 90],
    }
)

df

  region product  sales
0   East       A    100
1   East       B    150
2   West       A     80
3   West       B    200
4   East       A    130
5   West       A     90

In [4]:
pd.pivot_table(df, index="region", columns="product", values="sales", aggfunc="mean")

product      A      B
region
East     115.0  150.0
West      85.0  200.0

In [5]:
pd.pivot_table(df, index="region", columns="product", values="sales", aggfunc="sum")

product    A    B
region
East     230  150
West     170  200

In [6]:
pd.pivot_table(df, index=["region", "product"], values="sales", aggfunc="sum")

                sales
region product
East   A          230
       B          150
West   A          170
       B          200

In [7]:
df["quantity"] = [1, 2, 1, 3, 1, 1]

pd.pivot_table(
    df, index="region", columns="product", values=["sales", "quantity"], aggfunc="sum"
)

        quantity    sales
product        A  B     A    B
region
East           2  2   230  150
West           2  3   170  200

## reset_index()

In [14]:
import pandas as pd

df = pd.DataFrame(
    {
        "region": ["East", "East", "West", "West"],
        "product": ["A", "B", "A", "B"],
        "sales": [100, 150, 80, 200],
    }
)
df

  region product  sales
0   East       A    100
1   East       B    150
2   West       A     80
3   West       B    200

In [ ]:
pivot = pd.pivot_table(df, index=["region", "product"], values="sales", aggfunc="sum")
pivot

                sales
region product
East   A          100
       B          150
West   A           80
       B          200

In [16]:
pivot_reset = pivot.reset_index()
pivot_reset

  region product  sales
0   East       A    100
1   East       B    150
2   West       A     80
3   West       B    200

## melt()

In [12]:
import pandas as pd

df = pd.DataFrame({"student": ["Alice", "Bob"], "math": [90, 80], "english": [85, 70]})

df

  student  math  english
0   Alice    90       85
1     Bob    80       70

In [ ]:
pd.melt(df, id_vars="student", value_vars=["math", "english"])

  student variable  value
0   Alice     math     90
1     Bob     math     80
2   Alice  english     85
3     Bob  english     70

## concat()

In [ ]:
import pandas as pd

df1 = pd.DataFrame({"A": ["A0", "A1"], "B": ["B0", "B1"]})
df1

    A   B
0  A0  B0
1  A1  B1

In [ ]:
df2 = pd.DataFrame({"A": ["A2", "A3"], "B": ["B2", "B3"]})
df2

    A   B
0  A2  B2
1  A3  B3

In [ ]:
pd.concat([df1, df2])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [ ]:
pd.concat([df1, df2], axis=1)

    A   B   A   B
0  A0  B0  A2  B2
1  A1  B1  A3  B3

In [ ]:
pd.concat([df1, df2], keys=["df1", "df2"])

        A   B
df1 0  A0  B0
    1  A1  B1
df2 0  A2  B2
    1  A3  B3

## merge()

In [23]:
import pandas as pd

df1 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})
df1

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie

In [24]:

df2 = pd.DataFrame({
    'id': [2, 3, 4],
    'score': [85, 90, 75]
})
df2

   id  score
0   2     85
1   3     90
2   4     75

In [25]:
pd.merge(df1, df2, on='id')

   id     name  score
0   2      Bob     85
1   3  Charlie     90

In [26]:
pd.merge(df1, df2, on='id', how='left')

   id     name  score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0

In [27]:
pd.merge(df1, df2, on='id', how='right')

   id     name  score
0   2      Bob     85
1   3  Charlie     90
2   4      NaN     75

In [28]:
pd.merge(df1, df2, on='id', how='outer')

   id     name  score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0
3   4      NaN   75.0

In [29]:
df3 = pd.DataFrame({
    'user_id': [2, 3, 4],
    'score': [85, 90, 75]
})

pd.merge(df1, df3, left_on='id', right_on='user_id')

   id     name  user_id  score
0   2      Bob        2     85
1   3  Charlie        3     90